In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({
    'Name': ['John', 'Jane', 'John', 'Mike', 'Jane'],
    'Age': [28, 32, 28, 45, 32],
    'City': ['New York', 'Boston', 'New York', 'Chicago', 'Boston']
})

df

   Name  Age      City
0  John   28  New York
1  Jane   32    Boston
2  John   28  New York
3  Mike   45   Chicago
4  Jane   32    Boston

In [3]:
df.duplicated()

0    False
1    False
2     True
3    False
4     True
dtype: bool

In [22]:
df

   Name  Age      City
0  John   28  New York
1  Jane   32    Boston
2  John   28  New York
3  Mike   45   Chicago
4  Jane   32    Boston

In [11]:
df.duplicated(keep='first')

0    False
1    False
2     True
3    False
4     True
dtype: bool

In [12]:
df.duplicated(keep='last')

0     True
1     True
2    False
3    False
4    False
dtype: bool

In [15]:
df.duplicated(keep=False)

0     True
1     True
2     True
3    False
4     True
dtype: bool

In [18]:
df.duplicated(subset=['Name'])

0    False
1    False
2     True
3    False
4     True
dtype: bool

In [19]:
df.duplicated(subset=['Name', 'City'])

0    False
1    False
2     True
3    False
4     True
dtype: bool

In [35]:
df = df.drop_duplicates(subset=['Name', 'City'], keep='first')
df.index = np.arange(1, len(df)+1)
df

   Name  Age      City
1  John   28  New York
2  Jane   32    Boston
3  Mike   45   Chicago